; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types locatable city flevel - object
        aircraft person - locatable)
(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-5-15)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city6)
	(fuel-level plane1 fl2)
	(at plane2 city0)
	(fuel-level plane2 fl3)
	(at plane3 city10)
	(fuel-level plane3 fl5)
	(at plane4 city4)
	(fuel-level plane4 fl4)
	(at plane5 city1)
	(fuel-level plane5 fl6)
	(at person1 city8)
	(at person2 city12)
	(at person3 city0)
	(at person4 city4)
	(at person5 city13)
	(at person6 city7)
	(at person7 city1)
	(at person8 city2)
	(at person9 city1)
	(at person10 city2)
	(at person11 city10)
	(at person12 city7)
	(at person13 city6)
	(at person14 city1)
	(at person15 city13)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city12)
	(at plane3 city6)
	(at person1 city3)
	(at person2 city4)
	(at person3 city11)
	(at person4 city13)
	(at person5 city11)
	(at person6 city7)
	(at person7 city1)
	(at person8 city11)
	(at person9 city2)
	(at person10 city6)
	(at person11 city0)
	(at person12 city12)
	(at person13 city13)
	(at person14 city4)
	(at person15 city4)
	))
(:metric minimize (total-time))

)

; plan
1. (zoom plane4 city4 city12 fl4 fl3 fl2)
   deleted: (at plane4 city4) (fuel-level plane4 fl4)
   added: (at plane4 city12) (fuel-level plane4 fl2)
   goals met: 2 of 17
2. (board person9 plane5 city1)
   deleted: (at person9 city1)
   added: (in person9 plane5)
   goals met: 2 of 17
3. (board person11 plane3 city10)
   deleted: (at person11 city10)
   added: (in person11 plane3)
   goals met: 2 of 17
4. (zoom plane3 city10 city0 fl5 fl4 fl3)
   deleted: (at plane3 city10) (fuel-level plane3 fl5)
   added: (at plane3 city0) (fuel-level plane3 fl3)
   goals met: 2 of 17
5. (board person2 plane4 city12)
   deleted: (at person2 city12)
   added: (in person2 plane4)
   goals met: 2 of 17
6. (fly plane1 city6 city8 fl2 fl1)
   deleted: (at plane1 city6) (fuel-level plane1 fl2)
   added: (at plane1 city8) (fuel-level plane1 fl1)
   goals met: 2 of 17
7. (board person1 plane1 city8)
   deleted: (at person1 city8)
   added: (in person1 plane1)
   goals met: 2 of 17
8. (fly plane4 city12 city4 fl2 fl1)
   deleted: (at plane4 city12) (fuel-level plane4 fl2)
   added: (at plane4 city4) (fuel-level plane4 fl1)
   goals met: 2 of 17
9. (debark person11 plane3 city0)
   deleted: (in person11 plane3)
   added: (at person11 city0)
   goals met: 3 of 17
10. (fly plane3 city0 city6 fl3 fl2)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city6) (fuel-level plane3 fl2)
   goals met: 4 of 17
11. (fly plane5 city1 city2 fl6 fl5)
   deleted: (at plane5 city1) (fuel-level plane5 fl6)
   added: (at plane5 city2) (fuel-level plane5 fl5)
   goals met: 4 of 17
12. (debark person9 plane5 city2)
   deleted: (in person9 plane5)
   added: (at person9 city2)
   goals met: 5 of 17
13. (debark person2 plane4 city4)
   deleted: (in person2 plane4)
   added: (at person2 city4)
   goals met: 6 of 17
14. (board person4 plane4 city4)
   deleted: (at person4 city4)
   added: (in person4 plane4)
   goals met: 6 of 17
15. (fly plane4 city4 city13 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city13) (fuel-level plane4 fl0)
   goals met: 6 of 17
16. (board person13 plane3 city6)
   deleted: (at person13 city6)
   added: (in person13 plane3)
   goals met: 6 of 17
17. (debark person4 plane4 city13)
   deleted: (in person4 plane4)
   added: (at person4 city13)
   goals met: 7 of 17
18. (fly plane3 city6 city13 fl2 fl1)
   deleted: (at plane3 city6) (fuel-level plane3 fl2)
   added: (at plane3 city13) (fuel-level plane3 fl1)
   goals met: 6 of 17
19. (debark person13 plane3 city13)
   deleted: (in person13 plane3)
   added: (at person13 city13)
   goals met: 7 of 17
20. (fly plane3 city13 city4 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 7 of 17
21. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 17
22. (fly plane3 city4 city1 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 7 of 17
23. (board person14 plane3 city1)
   deleted: (at person14 city1)
   added: (in person14 plane3)
   goals met: 7 of 17
24. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 17
25. (fly plane3 city1 city4 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 7 of 17
26. (debark person14 plane3 city4)
   deleted: (in person14 plane3)
   added: (at person14 city4)
   goals met: 8 of 17
27. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 17
28. (fly plane3 city4 city6 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 9 of 17
29. (fly plane1 city8 city3 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 9 of 17
30. (debark person1 plane1 city3)
   deleted: (in person1 plane1)
   added: (at person1 city3)
   goals met: 10 of 17
31. (board person5 plane4 city13)
   deleted: (at person5 city13)
   added: (in person5 plane4)
   goals met: 10 of 17
32. (refuel plane4 city13 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 10 of 17
33. (zoom plane2 city0 city13 fl3 fl2 fl1)
   deleted: (at plane2 city0) (fuel-level plane2 fl3)
   added: (at plane2 city13) (fuel-level plane2 fl1)
   goals met: 10 of 17
34. (board person15 plane2 city13)
   deleted: (at person15 city13)
   added: (in person15 plane2)
   goals met: 10 of 17
35. (fly plane2 city13 city4 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 10 of 17
36. (debark person15 plane2 city4)
   deleted: (in person15 plane2)
   added: (at person15 city4)
   goals met: 11 of 17
37. (fly plane4 city13 city11 fl1 fl0)
   deleted: (at plane4 city13) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 11 of 17
38. (debark person5 plane4 city11)
   deleted: (in person5 plane4)
   added: (at person5 city11)
   goals met: 12 of 17
39. (board person10 plane5 city2)
   deleted: (at person10 city2)
   added: (in person10 plane5)
   goals met: 12 of 17
40. (board person8 plane5 city2)
   deleted: (at person8 city2)
   added: (in person8 plane5)
   goals met: 12 of 17
41. (fly plane5 city2 city11 fl5 fl4)
   deleted: (at plane5 city2) (fuel-level plane5 fl5)
   added: (at plane5 city11) (fuel-level plane5 fl4)
   goals met: 12 of 17
42. (debark person8 plane5 city11)
   deleted: (in person8 plane5)
   added: (at person8 city11)
   goals met: 13 of 17
43. (refuel plane5 city11 fl4 fl5)
   deleted: (fuel-level plane5 fl4)
   added: (fuel-level plane5 fl5)
   goals met: 13 of 17
44. (zoom plane5 city11 city2 fl5 fl4 fl3)
   deleted: (at plane5 city11) (fuel-level plane5 fl5)
   added: (at plane5 city2) (fuel-level plane5 fl3)
   goals met: 13 of 17
45. (refuel plane5 city2 fl3 fl4)
   deleted: (fuel-level plane5 fl3)
   added: (fuel-level plane5 fl4)
   goals met: 13 of 17
46. (refuel plane5 city2 fl4 fl5)
   deleted: (fuel-level plane5 fl4)
   added: (fuel-level plane5 fl5)
   goals met: 13 of 17
47. (fly plane5 city2 city6 fl5 fl4)
   deleted: (at plane5 city2) (fuel-level plane5 fl5)
   added: (at plane5 city6) (fuel-level plane5 fl4)
   goals met: 13 of 17
48. (debark person10 plane5 city6)
   deleted: (in person10 plane5)
   added: (at person10 city6)
   goals met: 14 of 17
49. (fly plane5 city6 city7 fl4 fl3)
   deleted: (at plane5 city6) (fuel-level plane5 fl4)
   added: (at plane5 city7) (fuel-level plane5 fl3)
   goals met: 14 of 17
50. (board person12 plane5 city7)
   deleted: (at person12 city7)
   added: (in person12 plane5)
   goals met: 14 of 17
51. (zoom plane5 city7 city12 fl3 fl2 fl1)
   deleted: (at plane5 city7) (fuel-level plane5 fl3)
   added: (at plane5 city12) (fuel-level plane5 fl1)
   goals met: 14 of 17
52. (debark person12 plane5 city12)
   deleted: (in person12 plane5)
   added: (at person12 city12)
   goals met: 15 of 17
53. (fly plane5 city12 city0 fl1 fl0)
   deleted: (at plane5 city12) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 15 of 17
54. (board person3 plane5 city0)
   deleted: (at person3 city0)
   added: (in person3 plane5)
   goals met: 15 of 17
55. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 15 of 17
56. (fly plane5 city0 city11 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city11) (fuel-level plane5 fl0)
   goals met: 15 of 17
57. (debark person3 plane5 city11)
   deleted: (in person3 plane5)
   added: (at person3 city11)
   goals met: 16 of 17
58. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 16 of 17
59. (fly plane2 city4 city12 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 17 of 17
